website/ledger_lunacy/app/controllers/transactions_controller.rb

  def index
    # Retrieve distinct transactions ordered by date in ascending order
    @transactions = Transaction.select(:activity_id).distinct.order(date: :asc)
---
SELECT DISTINCT "transactions"."activity_id" FROM "transactions" ORDER BY "transactions"."date" DESC LIMIT ?  [["LIMIT", 1]]