website/ledger_lunacy/app/helpers/transactions_helper.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."activity_id" = ? LIMIT ?  [["activity_id", "1"], ["LIMIT", 1]]
---
  def find_unique_transaction(transaction)
    Transaction.find_by(activity_id: transaction.activity_id)